STMicroelectronics/STM32CubeC5/examples/middleware/filex/nor_multi_access_freertos/NUCLEO-C562RE/generated/hal/mx_gpio_default.h
/**
  ******************************************************************************
  * @file           : mx_gpio_default.h
  * @brief          : Header for mx_gpio_default.c file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the mx_stm32c5xx_hal_drivers_license.md file
  * in the same directory as the generated code.
  * If no mx_stm32c5xx_hal_drivers_license.md file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MX_GPIO_DEFAULT_H
#define MX_GPIO_DEFAULT_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"
#include "mx_def.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/******************************************************************************/
/* Exported defines for gpio_default in HAL layer                             */
/******************************************************************************/

/* Primary aliases for GPIO PC6 pin */
#define PC6_PORT                                        HAL_GPIOC
#define PC6_PIN                                         HAL_GPIO_PIN_6
#define PC6_INIT_STATE                                  HAL_GPIO_PIN_SET
#define PC6_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define PC6_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PC13 pin */
#define PC13_PORT                                       HAL_GPIOC
#define PC13_PIN                                        HAL_GPIO_PIN_13

/* Secondary aliases for GPIO PC13 pin */
#define MX_EXAMPLE_EXTI_TRIGGER_PORT                    HAL_GPIOC
#define MX_EXAMPLE_EXTI_TRIGGER_PIN                     HAL_GPIO_PIN_13

/* EXTI aliases */
#define MX_EXAMPLE_EXTI_TRIGGER_EXTI_LINE               HAL_EXTI_LINE_13
#define MX_EXAMPLE_EXTI_TRIGGER_EXTI_TRIGGER            HAL_EXTI_TRIGGER_RISING

/* Exported macros -----------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
/******************************************************************************/
/* Exported functions for gpio_default in HAL layer                           */
/******************************************************************************/
/**
  * @brief mx_gpio_default init function
  * This function configures the hardware resources used in this example
  * @retval 0  GPIO group correctly initialized
  * @retval -1 Issue detected during GPIO group initialization
  */
system_status_t mx_gpio_default_init(void);

/**
  * @brief  De-initialize gpio_default instance.
  */
system_status_t mx_gpio_default_deinit(void);

/**
  * @brief  Get the EXTI13 object.
  * @retval Pointer on the EXTI13 Handle
  */
hal_exti_handle_t *mx_gpio_default_exti13_gethandle(void);

/******************************************************************************/
/*                           EXTI Line13 interrupt                            */
/******************************************************************************/
void EXTI13_IRQHandler(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* MX_GPIO_DEFAULT_H */
